CONFIGURATION VLAN

Switch>
Switch>en
Switch#conf t
Switch(config)#vlan 1
Switch(config-vlan)#name VLAN1
Default VLAN 1 may not have its name changed.

Switch(config-vlan)#exit
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#switchport acces vlan 1
Switch(config-if)#exit
Switch(config)#interface fastEthernet 0/2
Switch(config-if)#switchport acces vlan 1
Switch(config-if)#exit

VLAN2
Switch(config)#vlan 2
Switch(config-vlan)#name VLAN2
Switch(config-vlan)#exit
Switch(config)#interface fastEthernet 0/3
Switch(config-if)#switchport acces vlan 2
Switch(config-if)#exit
Switch(config)#interface fastEthernet 0/4
Switch(config-if)#switchport acces vlan 2
Switch(config-if)#exit


VLAN3
Switch(config)#vlan 3
Switch(config-vlan)#name VLAN3
Switch(config-vlan)#exit
Switch(config)#interface fastEthernet 0/5
Switch(config-if)#switchport acces vlan 3
Switch(config-if)#exit
Switch(config)#interface fastEthernet 0/6
Switch(config-if)#switchport acces vlan 3
Switch(config-if)#exit

VLAN4
Switch(config)#vlan 4
Switch(config-vlan)#name VLAN4
Switch(config-vlan)#exit
Switch(config)#interface fastEthernet 0/7
Switch(config-if)#switchport acces vlan 4
Switch(config-if)#exit
Switch(config)#interface fastEthernet 0/8
Switch(config-if)#switchport acces vlan 4
Switch(config-if)#exit

Switch#copy running-config startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]
Switch#



Switch(config)#interface fastEthernet 0/9
Switch(config-if)#swi
Switch(config-if)#switchport mo
Switch(config-if)#switchport mode tru
Switch(config-if)#switchport mode trunk 
Switch(config-if)#switchport trunk allowed vlan 1,2,3,4 
Switch(config-if)#exit
Switch(config)#exit
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#copy run
Switch#copy running-config star
Switch#copy running-config startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]
Switch#

Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#inte
Router(config)#interface g
Router(config)#interface gigabitEthernet 0/0/0
Router(config-if)#exit
Router(config)#interface gigabitEthernet 0/0/0.2
Router(config-subif)#enc
Router(config-subif)#encapsulation do
Router(config-subif)#encapsulation dot1Q 2
Router(config-subif)#ip ad
Router(config-subif)#ip address 192.168.1.254 255.255.255.0
Router(config-subif)#exit
Router(config)#int
Router(config)#interface g
Router(config)#interface gigabitEthernet 0/0/0.3
Router(config-subif)#enc
Router(config-subif)#encapsulation do
Router(config-subif)#encapsulation dot1Q 3
Router(config-subif)#ip add
Router(config-subif)#ip address 192.168.2.254 255.255.255.0
Router(config-subif)#exit
Router(config)#int
Router(config)#interface g
Router(config)#interface gigabitEthernet 0/0/0.4
Router(config-subif)#enc
Router(config-subif)#encapsulation do
Router(config-subif)#encapsulation dot1Q 4
Router(config-subif)#ip ad
Router(config-subif)#ip address 192.168.3.254 255.255.255.0
Router(config-subif)#exit
Router(config)#int
Router(config)#interface g
Router(config)#interface gigabitEthernet 0/0/0.1
Router(config-subif)#enc
Router(config-subif)#encapsulation do
Router(config-subif)#encapsulation dot1Q 1
Router(config-subif)#ip ad
Router(config-subif)#ip address 192.168.0.254 255.255.255.0
Router(config-subif)#exit
Router(config)#in
Router(config)#interface g
Router(config)#interface gigabitEthernet 0/0/0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up

%LINK-5-CHANGED: Interface GigabitEthernet0/0/0.1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0.1, changed state to up

%LINK-5-CHANGED: Interface GigabitEthernet0/0/0.2, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0.2, changed state to up

%LINK-5-CHANGED: Interface GigabitEthernet0/0/0.3, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0.3, changed state to up

%LINK-5-CHANGED: Interface GigabitEthernet0/0/0.4, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0.4, changed state to up

Router(config-if)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#copy runn
Router#copy running-config st
Router#copy running-config startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]
Router#